{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: neo4j in /Users/aina/opt/anaconda3/lib/python3.9/site-packages (5.14.1)\n",
      "Requirement already satisfied: pytz in /Users/aina/opt/anaconda3/lib/python3.9/site-packages (from neo4j) (2021.3)\n"
     ]
    }
   ],
   "source": [
    "!pip install neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "from joblib import Parallel, delayed\n",
    "import ast"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = \"neo4j://localhost:7687\"  # Replace with your URI \n",
    "user = \"neo4j\"                 # Replace with your username\n",
    "password = \"19091998\"          # Replace with your password\n",
    "\n",
    "driver = GraphDatabase.driver(uri, auth=(user, password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Neo4jConnection:\n",
    "    \n",
    "    def __init__(self, uri, user, password):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__password = password\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__password))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def execute_query(self, query):\n",
    "        if self.__driver is not None:\n",
    "            with self.__driver.session() as session:\n",
    "                return [record for record in session.run(query)]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "# label fields in the snomed ct graph\n",
    "\n",
    "q = \"\"\" MATCH (n:ObjectConcept)WHERE (n.FSN ENDS WITH '(finding)' or n.FSN ENDS WITH '(disorder)' )\n",
    "        SET n:SP\n",
    "        RETURN n LIMIT 10 \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Local excision of lesion or tissue of patella'"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn = Neo4jConnection(uri, user, password)\n",
    "\n",
    "query = \"\"\" MATCH (c:SP_ALL)-[:HAS_DESCRIPTION]->(d:Description)\n",
    "            WHERE d.descriptionType = 'Synonym'\n",
    "            RETURN c.id AS ConceptId, c.FSN AS FSN_concept, d.term AS Synonym\n",
    "\"\"\"\n",
    "\n",
    "results = conn.execute_query(query)\n",
    "\n",
    "results[0]['Synonym']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "r_df = pd.DataFrame(results, columns=['ConceptId', 'FSN_concept', 'Synonym'])\n",
    "r_df.to_csv('SP_ALL_EXT.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Run faiss indexing on all the synonyms, find most similar word"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# find node belonging to the synonym"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/fy/m2y3wbmn1lbcwm2rl2s60d_h0000gp/T/ipykernel_75512/1971303142.py:19: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with self.__driver.session() as session:\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record distance=3>\n"
     ]
    }
   ],
   "source": [
    "# Find shortest path between concepts \n",
    "query = \"\"\" MATCH p = shortestPath((start:SP {id: \"249473004\"})-[*..10]-(end:SP {id: \"102608004\"}))\n",
    "            RETURN length(p) as distance \"\"\"\n",
    "\n",
    "results = conn.execute_query(query)\n",
    "\n",
    "for record in results:\n",
    "    print(record)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/fy/m2y3wbmn1lbcwm2rl2s60d_h0000gp/T/ipykernel_75512/1971303142.py:19: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with self.__driver.session() as session:\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[<Record p=<Path start=<Node element_id='4:0c414c0f-b769-4d23-ad25-650efdf1893b:99185' labels=frozenset({'Finding', 'SP', 'SPFindings', 'ObjectConcept'}) properties={'FSN': 'Excessive appetite (finding)', 'nodetype': 'concept', 'effectiveTime': '20080731', 'definitionStatusId': '900000000000073002', 'active': '1', 'history': '[{\"id\": \"102608004\", \"effectiveTime\": \"20020131\", \"active\": \"1\", \"moduleId\": \"900000000000207008\", \"definitionStatusId\": \"900000000000074008\"}]', 'id': '102608004', 'moduleId': '900000000000207008', 'sctid': '102608004'}> end=<Node element_id='4:0c414c0f-b769-4d23-ad25-650efdf1893b:240538' labels=frozenset({'Finding', 'SP', 'SPFindings', 'ObjectConcept'}) properties={'FSN': 'Altered appetite (finding)', 'nodetype': 'concept', 'effectiveTime': '20080731', 'definitionStatusId': '900000000000073002', 'active': '1', 'history': '[{\"id\": \"249473004\", \"effectiveTime\": \"20020131\", \"active\": \"1\", \"moduleId\": \"900000000000207008\", \"definitionStatusId\": \"900000000000074008\"}]', 'id': '249473004', 'moduleId': '900000000000207008', 'sctid': '249473004'}> size=3> distance=3 endNodeId='249473004' start.FSN='Excessive appetite (finding)' NameEndNode='Altered appetite (finding)'>,\n",
       " <Record p=<Path start=<Node element_id='4:0c414c0f-b769-4d23-ad25-650efdf1893b:99185' labels=frozenset({'Finding', 'SP', 'SPFindings', 'ObjectConcept'}) properties={'FSN': 'Excessive appetite (finding)', 'nodetype': 'concept', 'effectiveTime': '20080731', 'definitionStatusId': '900000000000073002', 'active': '1', 'history': '[{\"id\": \"102608004\", \"effectiveTime\": \"20020131\", \"active\": \"1\", \"moduleId\": \"900000000000207008\", \"definitionStatusId\": \"900000000000074008\"}]', 'id': '102608004', 'moduleId': '900000000000207008', 'sctid': '102608004'}> end=<Node element_id='4:0c414c0f-b769-4d23-ad25-650efdf1893b:279263' labels=frozenset({'Finding', 'SP', 'SPFindings', 'ObjectConcept'}) properties={'FSN': 'Finding of appetite (finding)', 'nodetype': 'concept', 'effectiveTime': '20080731', 'definitionStatusId': '900000000000073002', 'active': '1', 'history': '[{\"id\": \"289161009\", \"effectiveTime\": \"20020131\", \"active\": \"1\", \"moduleId\": \"900000000000207008\", \"definitionStatusId\": \"900000000000074008\"}]', 'id': '289161009', 'moduleId': '900000000000207008', 'sctid': '289161009'}> size=2> distance=2 endNodeId='289161009' start.FSN='Excessive appetite (finding)' NameEndNode='Finding of appetite (finding)'>,\n",
       " <Record p=<Path start=<Node element_id='4:0c414c0f-b769-4d23-ad25-650efdf1893b:99185' labels=frozenset({'Finding', 'SP', 'SPFindings', 'ObjectConcept'}) properties={'FSN': 'Excessive appetite (finding)', 'nodetype': 'concept', 'effectiveTime': '20080731', 'definitionStatusId': '900000000000073002', 'active': '1', 'history': '[{\"id\": \"102608004\", \"effectiveTime\": \"20020131\", \"active\": \"1\", \"moduleId\": \"900000000000207008\", \"definitionStatusId\": \"900000000000074008\"}]', 'id': '102608004', 'moduleId': '900000000000207008', 'sctid': '102608004'}> end=<Node element_id='4:0c414c0f-b769-4d23-ad25-650efdf1893b:214199' labels=frozenset({'SP', 'Disorder', 'SPFindings', 'ObjectConcept'}) properties={'FSN': '[X]Appetite depressants [anorectics] causing adverse effects in therapeutic use (disorder)', 'nodetype': 'concept', 'effectiveTime': '20090131', 'definitionStatusId': '900000000000074008', 'active': '0', 'history': '[{\"id\": \"223123009\", \"effectiveTime\": \"20020131\", \"active\": \"1\", \"moduleId\": \"900000000000207008\", \"definitionStatusId\": \"900000000000074008\"}]', 'id': '223123009', 'moduleId': '900000000000207008', 'sctid': '223123009'}> size=7> distance=7 endNodeId='223123009' start.FSN='Excessive appetite (finding)' NameEndNode='[X]Appetite depressants [anorectics] causing adverse effects in therapeutic use (disorder)'>,\n",
       " <Record p=<Path start=<Node element_id='4:0c414c0f-b769-4d23-ad25-650efdf1893b:99185' labels=frozenset({'Finding', 'SP', 'SPFindings', 'ObjectConcept'}) properties={'FSN': 'Excessive appetite (finding)', 'nodetype': 'concept', 'effectiveTime': '20080731', 'definitionStatusId': '900000000000073002', 'active': '1', 'history': '[{\"id\": \"102608004\", \"effectiveTime\": \"20020131\", \"active\": \"1\", \"moduleId\": \"900000000000207008\", \"definitionStatusId\": \"900000000000074008\"}]', 'id': '102608004', 'moduleId': '900000000000207008', 'sctid': '102608004'}> end=<Node element_id='4:0c414c0f-b769-4d23-ad25-650efdf1893b:279265' labels=frozenset({'Finding', 'SP', 'SPFindings', 'ObjectConcept'}) properties={'FSN': 'Appetite problem (finding)', 'nodetype': 'concept', 'effectiveTime': '20020131', 'definitionStatusId': '900000000000074008', 'active': '1', 'history': '', 'id': '289163007', 'moduleId': '900000000000207008', 'sctid': '289163007'}> size=3> distance=3 endNodeId='289163007' start.FSN='Excessive appetite (finding)' NameEndNode='Appetite problem (finding)'>,\n",
       " <Record p=<Path start=<Node element_id='4:0c414c0f-b769-4d23-ad25-650efdf1893b:99185' labels=frozenset({'Finding', 'SP', 'SPFindings', 'ObjectConcept'}) properties={'FSN': 'Excessive appetite (finding)', 'nodetype': 'concept', 'effectiveTime': '20080731', 'definitionStatusId': '900000000000073002', 'active': '1', 'history': '[{\"id\": \"102608004\", \"effectiveTime\": \"20020131\", \"active\": \"1\", \"moduleId\": \"900000000000207008\", \"definitionStatusId\": \"900000000000074008\"}]', 'id': '102608004', 'moduleId': '900000000000207008', 'sctid': '102608004'}> end=<Node element_id='4:0c414c0f-b769-4d23-ad25-650efdf1893b:64277' labels=frozenset({'Finding', 'SP', 'SPFindings', 'ObjectConcept'}) properties={'FSN': 'Decrease in appetite (finding)', 'nodetype': 'concept', 'effectiveTime': '20080731', 'definitionStatusId': '900000000000073002', 'active': '1', 'history': '[{\"id\": \"64379006\", \"effectiveTime\": \"20020131\", \"active\": \"1\", \"moduleId\": \"900000000000207008\", \"definitionStatusId\": \"900000000000074008\"}]', 'id': '64379006', 'moduleId': '900000000000207008', 'sctid': '64379006'}> size=2> distance=2 endNodeId='64379006' start.FSN='Excessive appetite (finding)' NameEndNode='Decrease in appetite (finding)'>]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\" WITH [\"249473004\",\"289161009\", \"223123009\", \"289163007\", \"64379006\"] AS endNodeIds\n",
    "            MATCH (start:SP {id: \"102608004\"}) \n",
    "            UNWIND endNodeIds AS endNodeId\n",
    "            MATCH (end:SP {id: endNodeId})\n",
    "            CALL {\n",
    "                WITH start, end\n",
    "                MATCH p = shortestPath((start)-[*..10]-(end))\n",
    "                RETURN p\n",
    "                ORDER BY length(p) ASC LIMIT 1\n",
    "            }\n",
    "            RETURN p, length(p) as distance, end.id as endNodeId, start.FSN, end.FSN as NameEndNode \"\"\"\n",
    "\n",
    "results = conn.execute_query(query)\n",
    "\n",
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# extract the shortest path and handle codes with the exact same length "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# examples of failed matchings in the app "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Record ConceptId='104001' FSN_concept='Excision of lesion of patella (procedure)' num_desc=0 DescendantIDs=[] DescendantFSN=[]>"
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# extract the number of descendants and asc for each node \n",
    "\n",
    "conn = Neo4jConnection(uri, user, password)\n",
    "query = \"\"\" MATCH (c:SP_ALL)\n",
    "OPTIONAL MATCH (c)-[:ISA*]->(descendant:SP)\n",
    "WITH c, COLLECT(DISTINCT descendant.id) AS DescendantIDs, COLLECT(DISTINCT descendant.FSN) AS DescendantFSN\n",
    "RETURN c.id AS ConceptId, c.FSN AS FSN_concept,  SIZE(DescendantIDs) as num_desc, DescendantIDs, DescendantFSN\n",
    "\"\"\"\n",
    "\n",
    "results = conn.execute_query(query)\n",
    "pd.DataFrame(results).to_csv('descendants.csv', index=False)\n",
    "results[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Record ConceptId='104001' FSN_concept='Excision of lesion of patella (procedure)' num_anc=0 AncestorIDs=[] AncestorFSN=[]>"
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn = Neo4jConnection(uri, user, password)\n",
    "query = \"\"\" MATCH (c:SP_ALL)\n",
    "OPTIONAL MATCH (ancestor:SP)-[:ISA*]->(c)\n",
    "WITH c, COLLECT(DISTINCT ancestor.id) AS AncestorIDs, COLLECT(DISTINCT ancestor.FSN) AS AncestorFSN\n",
    "RETURN c.id AS ConceptId, c.FSN AS FSN_concept,  SIZE(AncestorIDs) as num_anc, AncestorIDs, AncestorFSN\n",
    "\"\"\"\n",
    "\n",
    "results = conn.execute_query(query)\n",
    "pd.DataFrame(results, columns=['ConceptId', 'FSN_concept', 'num_anc', 'AncestorIDs', 'AncestorFSN']).to_csv('ascendants.csv', index=False)\n",
    "results[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ConceptId</th>\n",
       "      <th>FSN_concept</th>\n",
       "      <th>num_anc</th>\n",
       "      <th>AncestorIDs</th>\n",
       "      <th>AncestorFSN</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>104001</td>\n",
       "      <td>Excision of lesion of patella (procedure)</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>105000</td>\n",
       "      <td>Poisoning by pharmaceutical excipient (disorder)</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>109006</td>\n",
       "      <td>Anxiety disorder of childhood OR adolescence (...</td>\n",
       "      <td>11</td>\n",
       "      <td>['90790003', '83253003', '64165008', '53467004...</td>\n",
       "      <td>['Avoidant disorder of adolescence (disorder)'...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>115006</td>\n",
       "      <td>Removable appliance therapy (procedure)</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>119000</td>\n",
       "      <td>Thoracoscopic partial lobectomy of lung (proce...</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263271</th>\n",
       "      <td>978253001000132109</td>\n",
       "      <td>Small bowel enteroscopy normal (finding)</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263272</th>\n",
       "      <td>985355341000119101</td>\n",
       "      <td>Malignant melanoma of skin of left wrist (diso...</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263273</th>\n",
       "      <td>987840791000119102</td>\n",
       "      <td>Adenosine deaminase 2 deficiency (disorder)</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263274</th>\n",
       "      <td>991898981000119108</td>\n",
       "      <td>Chronic nontraumatic intracranial subdural hem...</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263275</th>\n",
       "      <td>997199941000119102</td>\n",
       "      <td>Fluoroscopic venography of left limb with cont...</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>263276 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                 ConceptId                                        FSN_concept  \\\n",
       "0                   104001          Excision of lesion of patella (procedure)   \n",
       "1                   105000   Poisoning by pharmaceutical excipient (disorder)   \n",
       "2                   109006  Anxiety disorder of childhood OR adolescence (...   \n",
       "3                   115006            Removable appliance therapy (procedure)   \n",
       "4                   119000  Thoracoscopic partial lobectomy of lung (proce...   \n",
       "...                    ...                                                ...   \n",
       "263271  978253001000132109           Small bowel enteroscopy normal (finding)   \n",
       "263272  985355341000119101  Malignant melanoma of skin of left wrist (diso...   \n",
       "263273  987840791000119102        Adenosine deaminase 2 deficiency (disorder)   \n",
       "263274  991898981000119108  Chronic nontraumatic intracranial subdural hem...   \n",
       "263275  997199941000119102  Fluoroscopic venography of left limb with cont...   \n",
       "\n",
       "        num_anc                                        AncestorIDs  \\\n",
       "0             0                                                 []   \n",
       "1             0                                                 []   \n",
       "2            11  ['90790003', '83253003', '64165008', '53467004...   \n",
       "3             0                                                 []   \n",
       "4             0                                                 []   \n",
       "...         ...                                                ...   \n",
       "263271        0                                                 []   \n",
       "263272        0                                                 []   \n",
       "263273        0                                                 []   \n",
       "263274        0                                                 []   \n",
       "263275        0                                                 []   \n",
       "\n",
       "                                              AncestorFSN  \n",
       "0                                                      []  \n",
       "1                                                      []  \n",
       "2       ['Avoidant disorder of adolescence (disorder)'...  \n",
       "3                                                      []  \n",
       "4                                                      []  \n",
       "...                                                   ...  \n",
       "263271                                                 []  \n",
       "263272                                                 []  \n",
       "263273                                                 []  \n",
       "263274                                                 []  \n",
       "263275                                                 []  \n",
       "\n",
       "[263276 rows x 5 columns]"
      ]
     },
     "execution_count": 66,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ant_df = pd.read_csv('ascendants.csv')\n",
    "des_df = pd.read_csv('descendants.csv')\n",
    "ant_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ConceptId</th>\n",
       "      <th>FSN_concept</th>\n",
       "      <th>num_des</th>\n",
       "      <th>DescendantIDs</th>\n",
       "      <th>DescendantFSN</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>104001</td>\n",
       "      <td>Excision of lesion of patella (procedure)</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>105000</td>\n",
       "      <td>Poisoning by pharmaceutical excipient (disorder)</td>\n",
       "      <td>8</td>\n",
       "      <td>['7895008', '55680006', '441952005', '75478009...</td>\n",
       "      <td>['Poisoning caused by drug AND/OR medicinal su...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>109006</td>\n",
       "      <td>Anxiety disorder of childhood OR adolescence (...</td>\n",
       "      <td>17</td>\n",
       "      <td>['197480006', '268664001', '111476001', '48694...</td>\n",
       "      <td>['Anxiety disorder (disorder)', 'Childhood emo...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>115006</td>\n",
       "      <td>Removable appliance therapy (procedure)</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>119000</td>\n",
       "      <td>Thoracoscopic partial lobectomy of lung (proce...</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263271</th>\n",
       "      <td>978253001000132109</td>\n",
       "      <td>Small bowel enteroscopy normal (finding)</td>\n",
       "      <td>12</td>\n",
       "      <td>['22558701000132108', '370351008', '441742003'...</td>\n",
       "      <td>['Enteroscopy finding (finding)', 'Endoscopy f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263272</th>\n",
       "      <td>985355341000119101</td>\n",
       "      <td>Malignant melanoma of skin of left wrist (diso...</td>\n",
       "      <td>105</td>\n",
       "      <td>['352201000119105', '93654000', '4514110001241...</td>\n",
       "      <td>['Malignant melanoma of skin of left upper lim...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263273</th>\n",
       "      <td>987840791000119102</td>\n",
       "      <td>Adenosine deaminase 2 deficiency (disorder)</td>\n",
       "      <td>32</td>\n",
       "      <td>['44940001', '362993009', '129456006', '363138...</td>\n",
       "      <td>['Adenosine deaminase deficiency (disorder)', ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263274</th>\n",
       "      <td>991898981000119108</td>\n",
       "      <td>Chronic nontraumatic intracranial subdural hem...</td>\n",
       "      <td>103</td>\n",
       "      <td>['304831001', '281864001', '85974009', '128283...</td>\n",
       "      <td>['Chronic intracranial subdural hematoma (diso...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263275</th>\n",
       "      <td>997199941000119102</td>\n",
       "      <td>Fluoroscopic venography of left limb with cont...</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>263276 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                 ConceptId                                        FSN_concept  \\\n",
       "0                   104001          Excision of lesion of patella (procedure)   \n",
       "1                   105000   Poisoning by pharmaceutical excipient (disorder)   \n",
       "2                   109006  Anxiety disorder of childhood OR adolescence (...   \n",
       "3                   115006            Removable appliance therapy (procedure)   \n",
       "4                   119000  Thoracoscopic partial lobectomy of lung (proce...   \n",
       "...                    ...                                                ...   \n",
       "263271  978253001000132109           Small bowel enteroscopy normal (finding)   \n",
       "263272  985355341000119101  Malignant melanoma of skin of left wrist (diso...   \n",
       "263273  987840791000119102        Adenosine deaminase 2 deficiency (disorder)   \n",
       "263274  991898981000119108  Chronic nontraumatic intracranial subdural hem...   \n",
       "263275  997199941000119102  Fluoroscopic venography of left limb with cont...   \n",
       "\n",
       "        num_des                                      DescendantIDs  \\\n",
       "0             0                                                 []   \n",
       "1             8  ['7895008', '55680006', '441952005', '75478009...   \n",
       "2            17  ['197480006', '268664001', '111476001', '48694...   \n",
       "3             0                                                 []   \n",
       "4             0                                                 []   \n",
       "...         ...                                                ...   \n",
       "263271       12  ['22558701000132108', '370351008', '441742003'...   \n",
       "263272      105  ['352201000119105', '93654000', '4514110001241...   \n",
       "263273       32  ['44940001', '362993009', '129456006', '363138...   \n",
       "263274      103  ['304831001', '281864001', '85974009', '128283...   \n",
       "263275        0                                                 []   \n",
       "\n",
       "                                            DescendantFSN  \n",
       "0                                                      []  \n",
       "1       ['Poisoning caused by drug AND/OR medicinal su...  \n",
       "2       ['Anxiety disorder (disorder)', 'Childhood emo...  \n",
       "3                                                      []  \n",
       "4                                                      []  \n",
       "...                                                   ...  \n",
       "263271  ['Enteroscopy finding (finding)', 'Endoscopy f...  \n",
       "263272  ['Malignant melanoma of skin of left upper lim...  \n",
       "263273  ['Adenosine deaminase deficiency (disorder)', ...  \n",
       "263274  ['Chronic intracranial subdural hematoma (diso...  \n",
       "263275                                                 []  \n",
       "\n",
       "[263276 rows x 5 columns]"
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# ant_df.columns = ['ConceptId', 'FSN_concept', 'num_anc', 'AncestorIDs', 'AncestorFSN']\n",
    "des_df.columns = ['ConceptId', 'FSN_concept', 'num_des', 'DescendantIDs', 'DescendantFSN']\n",
    "des_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([True, True], 1.0)"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import numpy as np\n",
    "\n",
    "def compute_similar_names(name, l):\n",
    "    sim = []\n",
    "    for i in l:\n",
    "        s = False\n",
    "        c=0\n",
    "        x = True if name in i else False\n",
    "        if x: \n",
    "            s = True\n",
    "        \n",
    "        tk_name = name.lower().split()\n",
    "        for k in tk_name:\n",
    "            c += 1 if k in i else 0\n",
    "        \n",
    "        if c/len(tk_name)>=0.5:\n",
    "            s = True\n",
    "        \n",
    "        sim.append(s)\n",
    "    np.mean(sim)\n",
    "    return sim, np.mean(sim)\n",
    "\n",
    "# compute_similar_names('aina tersol', ['aina', 'aina goes to schol'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1min 18s, sys: 10.2 s, total: 1min 28s\n",
      "Wall time: 1min 37s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "def process_row(row, col_name):\n",
    "    return compute_similar_names(row['FSN_concept'], ast.literal_eval(row[col_name]))\n",
    "\n",
    "results = Parallel(n_jobs=-1)(delayed(process_row)(row, 'AncestorFSN') for index, row in ant_df.iterrows())\n",
    "ant_df[['sim', 'mean']] = pd.DataFrame(results, index=ant_df.index)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ConceptId</th>\n",
       "      <th>FSN_concept</th>\n",
       "      <th>num_anc</th>\n",
       "      <th>AncestorIDs</th>\n",
       "      <th>AncestorFSN</th>\n",
       "      <th>sim</th>\n",
       "      <th>mean</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>109006</td>\n",
       "      <td>Anxiety disorder of childhood OR adolescence (...</td>\n",
       "      <td>11</td>\n",
       "      <td>['90790003', '83253003', '64165008', '53467004...</td>\n",
       "      <td>['Avoidant disorder of adolescence (disorder)'...</td>\n",
       "      <td>[True, True, True, True, True, True, True, Tru...</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>122003</td>\n",
       "      <td>Choroidal hemorrhage (disorder)</td>\n",
       "      <td>13</td>\n",
       "      <td>['193474002', '336061000119102', '341671000119...</td>\n",
       "      <td>['Choroidal hemorrhage and rupture (disorder)'...</td>\n",
       "      <td>[True, False, False, True, True, True, True, T...</td>\n",
       "      <td>0.692308</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>140004</td>\n",
       "      <td>Chronic pharyngitis (disorder)</td>\n",
       "      <td>28</td>\n",
       "      <td>['133171000119105', '24078009', '90979004', '4...</td>\n",
       "      <td>['Chronic pharyngolaryngitis (disorder)', 'Gan...</td>\n",
       "      <td>[False, False, False, True, True, True, True, ...</td>\n",
       "      <td>0.321429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>198007</td>\n",
       "      <td>Disease caused by Filoviridae (disorder)</td>\n",
       "      <td>29</td>\n",
       "      <td>['45901000087102', '1163096003', '788870007', ...</td>\n",
       "      <td>['Disease caused by Zaire Ebolavirus (disorder...</td>\n",
       "      <td>[True, True, True, True, True, True, False, Fa...</td>\n",
       "      <td>0.275862</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>219006</td>\n",
       "      <td>Current drinker of alcohol (finding)</td>\n",
       "      <td>19</td>\n",
       "      <td>['10939881000119105', '447087000', '28127009',...</td>\n",
       "      <td>['Unhealthy alcohol drinking behavior (finding...</td>\n",
       "      <td>[False, False, False, False, False, False, Fal...</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263009</th>\n",
       "      <td>32100001000004100</td>\n",
       "      <td>Mass of cervical spine (disorder)</td>\n",
       "      <td>18</td>\n",
       "      <td>['203198001', '735605000', '713741003', '12655...</td>\n",
       "      <td>[\"Brodie's abscess of cervical spine (disorder...</td>\n",
       "      <td>[True, True, True, True, True, True, True, Tru...</td>\n",
       "      <td>0.833333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263050</th>\n",
       "      <td>115940341000119100</td>\n",
       "      <td>Chronic ulcer of anastomosis (disorder)</td>\n",
       "      <td>19</td>\n",
       "      <td>['128288009', '56579005', '41626001', '1967210...</td>\n",
       "      <td>['Chronic gastrojejunal ulcer (disorder)', 'Ch...</td>\n",
       "      <td>[False, False, False, False, False, False, Fal...</td>\n",
       "      <td>0.055556</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263110</th>\n",
       "      <td>347218661000119103</td>\n",
       "      <td>Abrasion of mouth region (disorder)</td>\n",
       "      <td>25</td>\n",
       "      <td>['698524005', '698518004', '110154009', '26263...</td>\n",
       "      <td>['Generalized abrasion of tooth (disorder)', '...</td>\n",
       "      <td>[True, False, False, False, False, False, Fals...</td>\n",
       "      <td>0.240000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263205</th>\n",
       "      <td>751960361000119108</td>\n",
       "      <td>Lesion of nasal cavity (disorder)</td>\n",
       "      <td>132</td>\n",
       "      <td>['10872851000119104', '210328006', '282451008'...</td>\n",
       "      <td>['Laceration of structure of nasal cavity (dis...</td>\n",
       "      <td>[True, True, True, False, True, False, True, T...</td>\n",
       "      <td>0.392308</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263216</th>\n",
       "      <td>786120041000132108</td>\n",
       "      <td>Psychotic disorder caused by substance (disorder)</td>\n",
       "      <td>121</td>\n",
       "      <td>['724655005', '191483003', '19445006', '203850...</td>\n",
       "      <td>['Psychotic disorder caused by opioid (disorde...</td>\n",
       "      <td>[True, True, True, True, True, True, True, Tru...</td>\n",
       "      <td>0.669421</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>16760 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                 ConceptId                                        FSN_concept  \\\n",
       "2                   109006  Anxiety disorder of childhood OR adolescence (...   \n",
       "6                   122003                    Choroidal hemorrhage (disorder)   \n",
       "15                  140004                     Chronic pharyngitis (disorder)   \n",
       "50                  198007           Disease caused by Filoviridae (disorder)   \n",
       "57                  219006               Current drinker of alcohol (finding)   \n",
       "...                    ...                                                ...   \n",
       "263009   32100001000004100                  Mass of cervical spine (disorder)   \n",
       "263050  115940341000119100            Chronic ulcer of anastomosis (disorder)   \n",
       "263110  347218661000119103                Abrasion of mouth region (disorder)   \n",
       "263205  751960361000119108                  Lesion of nasal cavity (disorder)   \n",
       "263216  786120041000132108  Psychotic disorder caused by substance (disorder)   \n",
       "\n",
       "        num_anc                                        AncestorIDs  \\\n",
       "2            11  ['90790003', '83253003', '64165008', '53467004...   \n",
       "6            13  ['193474002', '336061000119102', '341671000119...   \n",
       "15           28  ['133171000119105', '24078009', '90979004', '4...   \n",
       "50           29  ['45901000087102', '1163096003', '788870007', ...   \n",
       "57           19  ['10939881000119105', '447087000', '28127009',...   \n",
       "...         ...                                                ...   \n",
       "263009       18  ['203198001', '735605000', '713741003', '12655...   \n",
       "263050       19  ['128288009', '56579005', '41626001', '1967210...   \n",
       "263110       25  ['698524005', '698518004', '110154009', '26263...   \n",
       "263205      132  ['10872851000119104', '210328006', '282451008'...   \n",
       "263216      121  ['724655005', '191483003', '19445006', '203850...   \n",
       "\n",
       "                                              AncestorFSN  \\\n",
       "2       ['Avoidant disorder of adolescence (disorder)'...   \n",
       "6       ['Choroidal hemorrhage and rupture (disorder)'...   \n",
       "15      ['Chronic pharyngolaryngitis (disorder)', 'Gan...   \n",
       "50      ['Disease caused by Zaire Ebolavirus (disorder...   \n",
       "57      ['Unhealthy alcohol drinking behavior (finding...   \n",
       "...                                                   ...   \n",
       "263009  [\"Brodie's abscess of cervical spine (disorder...   \n",
       "263050  ['Chronic gastrojejunal ulcer (disorder)', 'Ch...   \n",
       "263110  ['Generalized abrasion of tooth (disorder)', '...   \n",
       "263205  ['Laceration of structure of nasal cavity (dis...   \n",
       "263216  ['Psychotic disorder caused by opioid (disorde...   \n",
       "\n",
       "                                                      sim      mean  \n",
       "2       [True, True, True, True, True, True, True, Tru...  1.000000  \n",
       "6       [True, False, False, True, True, True, True, T...  0.692308  \n",
       "15      [False, False, False, True, True, True, True, ...  0.321429  \n",
       "50      [True, True, True, True, True, True, False, Fa...  0.275862  \n",
       "57      [False, False, False, False, False, False, Fal...  0.000000  \n",
       "...                                                   ...       ...  \n",
       "263009  [True, True, True, True, True, True, True, Tru...  0.833333  \n",
       "263050  [False, False, False, False, False, False, Fal...  0.055556  \n",
       "263110  [True, False, False, False, False, False, Fals...  0.240000  \n",
       "263205  [True, True, True, False, True, False, True, T...  0.392308  \n",
       "263216  [True, True, True, True, True, True, True, Tru...  0.669421  \n",
       "\n",
       "[16760 rows x 7 columns]"
      ]
     },
     "execution_count": 74,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ant_df[ant_df['num_anc']>10]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3419: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "/Users/aina/opt/anaconda3/lib/python3.9/site-packages/numpy/core/_methods.py:188: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1min 11s, sys: 3.92 s, total: 1min 15s\n",
      "Wall time: 1min 18s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "results = Parallel(n_jobs=-1)(delayed(process_row)(row, 'DescendantFSN') for index, row in des_df.iterrows())\n",
    "des_df[['sim', 'mean']] = pd.DataFrame(results, index=des_df.index)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ConceptId</th>\n",
       "      <th>FSN_concept</th>\n",
       "      <th>num_des</th>\n",
       "      <th>DescendantIDs</th>\n",
       "      <th>DescendantFSN</th>\n",
       "      <th>sim</th>\n",
       "      <th>mean</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>104001</td>\n",
       "      <td>Excision of lesion of patella (procedure)</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>105000</td>\n",
       "      <td>Poisoning by pharmaceutical excipient (disorder)</td>\n",
       "      <td>8</td>\n",
       "      <td>['7895008', '55680006', '441952005', '75478009...</td>\n",
       "      <td>['Poisoning caused by drug AND/OR medicinal su...</td>\n",
       "      <td>[False, False, False, False, False, False, Fal...</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>109006</td>\n",
       "      <td>Anxiety disorder of childhood OR adolescence (...</td>\n",
       "      <td>17</td>\n",
       "      <td>['197480006', '268664001', '111476001', '48694...</td>\n",
       "      <td>['Anxiety disorder (disorder)', 'Childhood emo...</td>\n",
       "      <td>[False, False, True, False, False, False, Fals...</td>\n",
       "      <td>0.062500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>115006</td>\n",
       "      <td>Removable appliance therapy (procedure)</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>119000</td>\n",
       "      <td>Thoracoscopic partial lobectomy of lung (proce...</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263271</th>\n",
       "      <td>978253001000132109</td>\n",
       "      <td>Small bowel enteroscopy normal (finding)</td>\n",
       "      <td>12</td>\n",
       "      <td>['22558701000132108', '370351008', '441742003'...</td>\n",
       "      <td>['Enteroscopy finding (finding)', 'Endoscopy f...</td>\n",
       "      <td>[False, False, False, False, False, False, Fal...</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263272</th>\n",
       "      <td>985355341000119101</td>\n",
       "      <td>Malignant melanoma of skin of left wrist (diso...</td>\n",
       "      <td>105</td>\n",
       "      <td>['352201000119105', '93654000', '4514110001241...</td>\n",
       "      <td>['Malignant melanoma of skin of left upper lim...</td>\n",
       "      <td>[True, True, True, False, True, True, True, Tr...</td>\n",
       "      <td>0.262136</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263273</th>\n",
       "      <td>987840791000119102</td>\n",
       "      <td>Adenosine deaminase 2 deficiency (disorder)</td>\n",
       "      <td>32</td>\n",
       "      <td>['44940001', '362993009', '129456006', '363138...</td>\n",
       "      <td>['Adenosine deaminase deficiency (disorder)', ...</td>\n",
       "      <td>[True, False, False, False, False, False, Fals...</td>\n",
       "      <td>0.031250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263274</th>\n",
       "      <td>991898981000119108</td>\n",
       "      <td>Chronic nontraumatic intracranial subdural hem...</td>\n",
       "      <td>103</td>\n",
       "      <td>['304831001', '281864001', '85974009', '128283...</td>\n",
       "      <td>['Chronic intracranial subdural hematoma (diso...</td>\n",
       "      <td>[True, True, False, False, False, False, False...</td>\n",
       "      <td>0.058824</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263275</th>\n",
       "      <td>997199941000119102</td>\n",
       "      <td>Fluoroscopic venography of left limb with cont...</td>\n",
       "      <td>0</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>263276 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                 ConceptId                                        FSN_concept  \\\n",
       "0                   104001          Excision of lesion of patella (procedure)   \n",
       "1                   105000   Poisoning by pharmaceutical excipient (disorder)   \n",
       "2                   109006  Anxiety disorder of childhood OR adolescence (...   \n",
       "3                   115006            Removable appliance therapy (procedure)   \n",
       "4                   119000  Thoracoscopic partial lobectomy of lung (proce...   \n",
       "...                    ...                                                ...   \n",
       "263271  978253001000132109           Small bowel enteroscopy normal (finding)   \n",
       "263272  985355341000119101  Malignant melanoma of skin of left wrist (diso...   \n",
       "263273  987840791000119102        Adenosine deaminase 2 deficiency (disorder)   \n",
       "263274  991898981000119108  Chronic nontraumatic intracranial subdural hem...   \n",
       "263275  997199941000119102  Fluoroscopic venography of left limb with cont...   \n",
       "\n",
       "        num_des                                      DescendantIDs  \\\n",
       "0             0                                                 []   \n",
       "1             8  ['7895008', '55680006', '441952005', '75478009...   \n",
       "2            17  ['197480006', '268664001', '111476001', '48694...   \n",
       "3             0                                                 []   \n",
       "4             0                                                 []   \n",
       "...         ...                                                ...   \n",
       "263271       12  ['22558701000132108', '370351008', '441742003'...   \n",
       "263272      105  ['352201000119105', '93654000', '4514110001241...   \n",
       "263273       32  ['44940001', '362993009', '129456006', '363138...   \n",
       "263274      103  ['304831001', '281864001', '85974009', '128283...   \n",
       "263275        0                                                 []   \n",
       "\n",
       "                                            DescendantFSN  \\\n",
       "0                                                      []   \n",
       "1       ['Poisoning caused by drug AND/OR medicinal su...   \n",
       "2       ['Anxiety disorder (disorder)', 'Childhood emo...   \n",
       "3                                                      []   \n",
       "4                                                      []   \n",
       "...                                                   ...   \n",
       "263271  ['Enteroscopy finding (finding)', 'Endoscopy f...   \n",
       "263272  ['Malignant melanoma of skin of left upper lim...   \n",
       "263273  ['Adenosine deaminase deficiency (disorder)', ...   \n",
       "263274  ['Chronic intracranial subdural hematoma (diso...   \n",
       "263275                                                 []   \n",
       "\n",
       "                                                      sim      mean  \n",
       "0                                                      []       NaN  \n",
       "1       [False, False, False, False, False, False, Fal...  0.000000  \n",
       "2       [False, False, True, False, False, False, Fals...  0.062500  \n",
       "3                                                      []       NaN  \n",
       "4                                                      []       NaN  \n",
       "...                                                   ...       ...  \n",
       "263271  [False, False, False, False, False, False, Fal...  0.000000  \n",
       "263272  [True, True, True, False, True, True, True, Tr...  0.262136  \n",
       "263273  [True, False, False, False, False, False, Fals...  0.031250  \n",
       "263274  [True, True, False, False, False, False, False...  0.058824  \n",
       "263275                                                 []       NaN  \n",
       "\n",
       "[263276 rows x 7 columns]"
      ]
     },
     "execution_count": 79,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "des_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [],
   "source": [
    "ant_df.to_csv('asc_sim_count.csv', index=False)\n",
    "des_df.to_csv('des_sim_count.csv', index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
